package com.example.bijoya.main;

public class QuestionLibrary {
    private String mQuestions [] = {
            "বাংলায় ইউরোপীয় বণিকদের মধ্যে বানিজ্যের জন্য প্রথম এসেছিল-",
            "বাংলাদেশ লোকশিল্প জাদুঘর কোথায় অবস্থিত?",
            "বাংলাদেশ গনপ্রজাতন্ত্রের ঘোষনা হয়েছিল",
            "জলজ উদ্ভিদ অনেক ভাসতে পারে কারন- ",
            "বিখ্যাত সাধক শাহ সুলতান বলখিল মাজার কোথায়- ",
            "গনপ্রজাতন্ত্রি বাংলাদেশের সংবিধান প্রবর্তিত হয়- ",
            "নিকারাগুহার যে বিদ্রহীদের যুক্তরাষ্ট সমার্থন করে তার নাম- ",
            "আনারস এবং চাবি শব্দ বাংলা ভাষা গ্রহন করেছে-",
            "শুদ্ধ বানান কোনটি?",
            "কবর নাটকটির লেখক – ",
            "উভয়কূল রক্ষা অর্থে ব্যবহৃত প্রবচন কোনটি? ",
            "শুদ্ধ বাক্য কোনটি? ",
            "ক্রিয়া পদের মুল অংশকে বলা হয় – ",
            "রত্নাকর শব্দটির সন্ধিবিচ্ছেদ- ",
            "কোন দ্বিরুক্তি শব্দ দুটি বহুবচন সংকেত করে? ",
            "কোন প্রবচন বাক্য ব্যবহারিক দিক হতে সঠিক?",
            "বাংলায় টি, এস, এলিয়টের কবিতার প্রথম অনুবাদক? ",
            "আগ্নিবীণা কাব্য গ্রন্থে সংকলিত প্রথম কবিতা- ",
            "শেষের কবিতা রবীন্দ্রনাথের রচিত – ",
            "কোন বাক্যে মাথা শব্দটি বুদ্ধি অর্থে ব্যবহৃত হয়? ",
            "কোন শব্দে বিদেশী উপসর্গ ব্যবহৃত হয়েছে? ",
            "আমার ভাইয়ের রক্তে রাঙানো একুশে ফেব্রুয়ারী’র রচয়তা- ",
            "কোনটি তদ্ভব শব্দ? ",
            "বাংলায় কোরআন শরীফের প্রথম অনুবাদক কে? ",
            "Choose the correct alternative to complete the sentence. “ He – to see us he had been able to” ",
            "Choose the correct sentence. ",
            "Choose the correct sentence. ",
            "Choose the correct sentence. ",
            "Choose the correct answer. How long did you wait- ",
            "What will be the correct preposition to complete the sentence? \"I am not bad.... tennis.\" ",
            ""

    };


    private String mChoices [][] = {
            {"পর্তুগীজরা", "ইংরেজরা", "ত্তলন্দাজরা "},
            {"সোনারগাঁয়ে", "মহাস্থানে", "নেত্রকোনায়"},
            {"১৭ এপ্রিল ১৯৭১", "১৬ ডিসেম্বর ১৯৭২", "৭ মার্চ ১৭৭৩ "},
            {"এরা অনেক ছোট হয় ", "এদের কান্ডে অনেক বায়ু কুঠুরী থাকে ", "এরা পানিতে থাকে"},
            {"মহাস্থানে", "শাহজাদপুরে ", " রামপালে"},
            {"১৭ এপ্রিল ১৯৭১ ", "১৬ ডিসেম্বর ১৯৭২", "৭ মার্চ ১৭৭৩"},
            {" ইউনিটা ", "সান্ডিনিটা ", "কন্ট্রা " },
            {"প্রর্তুগ্রীজ ভাষা হতে","আরবী ভাষা হতে","দেশী ভাষা হতে"},
            {"মূমুর্ষু","মুমূর্ষু","মুমুর্ষু"},
            {"জসীমউদ্দীন","নজরুল ইসলাম","মুনির চৌধুরী"},
            {"চাল না চুলো-ঢেকি না কুলো","সাপও মরে লাঠি ও না ভাঙ্গে ","বোঝার উপর শাকের আৎটি "},
            {"দুর্বলতা বসত অনাথিনী বসে পড়ল","দুর্বলা বসত অনাথা বসে পড়ল ","দুর্বলতাবশত অনাথা বসে পড়ল"},
            {"বিভক্তি","ধাতু","প্রত্যয়"},
            {"রত্না + আকর ","রত্ন + আকর","রত্না + কর"},
            {"পাকা পাকা আম","ছি ছি কি করছ","নরম নরম হাত"},
            {"যত গর্জে তত বৃষ্টি হয় না","অধিক সন্যাসীতে গাজন নষ্ট","নাচতে না জানলে উঠান বাকা"},
            {"রবীন্দ্রনাথ ঠাকুর","বিষ্ণু দে","বুদ্ধদেব বসু"},
            {"অগ্রপথিক","বিদ্রোহী","প্রলয়উল্লাস"},
            {"কবিতার নাম ","গল্প সংকোলনের নাম","উপন্যাসের নাম"},
            {"তিনিই সমাজের মাথা ","মাথা খাটিয়ে কাজ করবে","লজ্জায় মাথা কাটা গেল"},
            {"আনমনা","নিখুত","নিমরাজী"},
            {"আলতাফ মাহমুদ","হাসান হাফিজুর রহমান","আবদুল গাফফার চৌধুরী"},
            {"চাঁদ","সূর্য","নক্ষত্র"},
            {"কেশব চন্দ্র সেন","গিরিশ চন্দ্র সেন","মাওলানা মনিরুজ্জামান ইসলামবাদী"},
            {"would come","would have come","may have come "},
            {"I asked Javed had he passed","I asked Javed if he had passed ","I asked Javed if you had passed "},
            {"A few of the three boys got a prize ","Each of the three boys got a prize ","Every of the three boys got a prize"},
            {"The man that said that was a fool ","The man who said that was a fool","The man that said that was a fool"},
            {"Till lunch time","Till he came","Until six o'clock"},
            {"in","at","about"},
            {"","",""},

    };



    private String mCorrectAnswers[] = {"পর্তুগীজরা", "সোনারগাঁয়ে", "১৭ এপ্রিল ১৯৭১", "এদের কান্ডে অনেক বায়ু কুঠুরী থাকে ","মহাস্থানে","১৬ ডিসেম্বর ১৯৭২",
    "কন্ট্রা ","প্রর্তুগ্রীজ ভাষা হতে","মূমুর্ষু","মুনির চৌধুরী","সাপও মরে লাঠি ও না ভাঙ্গে ","দুর্বলতাবশত অনাথা বসে পড়ল","ধাতু","রত্ন + আকর","পাকা পাকা আম",
    "অধিক সন্যাসীতে গাজন নষ্ট","বিষ্ণু দে","প্রলয়উল্লাস","উপন্যাসের নাম","মাথা খাটিয়ে কাজ করবে","নিমরাজী","আবদুল গাফফার চৌধুরী","চাঁদ",
    "গিরিশ চন্দ্র সেন","would come","I asked Javed if he had passed ","Each of the three boys got a prize ","The man who said that was a fool",
    "Till he came","at",""};




    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }


    public String getChoice1(int a) {
        String choice0 = mChoices[a][0];
        return choice0;
    }


    public String getChoice2(int a) {
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a) {
        String choice2 = mChoices[a][2];
        return choice2;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }
}
