package com.example.bijoya.main;

public class QuestionLibrary3 {
    private String mQuestions [] = {
            "ব্রিটেনের প্রশাসনিক সদর দপ্তর কে বলা হয়-  ",
            "দ্বিতীয় মহাযুদ্ধে জার্মানী আত্নসমার্পন করে- ",
            "কংগোকে বিদেশী শাসন থেকে মুক্ত করার লড়াইয়ে চিরস্মরনীয় নাম- ",
            "হিরোসিমায় এটোম বোমা ফেলা হয়েছিল- ",
            "নিকারাগুহার যে বিদ্রহীদের যুক্তরাষ্ট সমার্থন করে তার নাম- ",
            "আই,এম,এফ এর সদর দপ্তর কোথায় অবস্থিত? ",
            "নিকারাগুহার যে বিদ্রহীদের যুক্তরাষ্ট সমার্থন করে তার নাম- ",
            "ব্যাবলনের ঝুলন্ত উদ্যান কোন দেশে অবস্থিত? ",
            "ইতিহাস বিখ্যাত ট্রয় নগরী কোথায়? ",
            "নিচের কোন সংখ্যাটি মৌলিক? ",
            "কোন একটি জিনিস নির্মাতা ২০% লাভে ও খুচরা বিক্রেতা ২০% লাভে বিক্রয় করে। যদি ঐ জিনিসের নির্মান খরচ ১০০ টাকা হয় তবে খুচরা মূল্য কত? ",
            " ১ হতে ৪৯ পর্যন্ত ক্রমিক সংখ্যা গুলোর গড় কত? ",
            "টাকায় ৩ টি করে আম ক্রয় করে টাকায় ২ টি করে আম বিক্রি করলে শতকরা কত লাভ হবে? ",
            "ত্রিভুজ ABC এর BE=EF=CF। ABC ক্ষেত্রফল 48 বর্গফুট হলে ABC এর ক্ষেত্রফল কত বর্গফুট?",
            "a+b=5 এবং a-b=3 হলে ab এর মান কত? ",
            "৬০ লিটার কেরোসিন ও পেট্রোলিয়ামের মিশ্রনের অনুপাত ৭ : ৩।ঐ মিশ্রনে আর কত লিটার পেট্রোল মিশালে অনুপাত ৩ : ৭ হবে? ",
            "১ হতে ৩০ পর্যন্ত কয়টি মৌলিক সংখ্যা আছে? ",
            "সরল সুদের হার শতকরা কত হলে যে কোন মূলধন ৮ বৎসরে সুদে আসলে ৩ গুন হবে? ",
            "চিনির মূল্য ২৫% বৃদ্ধি পাওয়াতে একটি পরিবার চিনি খাওয়া এমনি ভাবে কমালো যে চিনি বাবদ ব্যয় বৃদ্ধি পেল না।ঐ পরিবারে চিনি খাওয়া খরচ শতকরা কত কমিয়েছিল? ",
            "ত্রিভুজের একটি কোন উহার অপর দুটি কোনের সমষ্টির সমান হলে ত্রিভুজটি- ",
            "কনবায়ন যোগ্য শক্তি উৎসের একটি উদাহরন হলো- ",
            "প্রেসার কুকারে রান্না তারাতারি হয় কারন- ",
            "কযে তিনটি মুখ্য বর্নের সমন্বয়ে অন্যান্য বর্ন সৃষ্টি করা যায় সেগুলি হল- ",
            "ভৌগলিক ভাবে গুরুত্বপূর্ন যে কাল্পনিক রেখাটি বাংলাদেশের উপর দিয়ে গিয়েছে তা হল- ",
            "মাছ অক্সিজেন নেয়- ",
            "কচু শাক বিশেষভাবে মূল্যবান যে উপাদানের জন্য তা হলো- ",
            "সাধারন ড্রাইসেলে ইলেকট্রোড হিসেবে থাকে? ",
            ".  দূরের বিদ্যুৎ উৎপাদন কেন্দ্র হতে বিদ্যুৎ নিয়ে আসতে হলে হাইড্রোভোল্টেজ ব্যবহার করার কারন- ",
            "সংকর ধাতু পিতলের উপাদান হল- ",
            "নিচের কোনটি জ্বীবাশ্ম জ্বালানী নয়- ",
            ""

    };


    private String mChoices [][] = {
            {"ওয়েস্ট", "হোয়াইট হল ", "বুশ হাউজ"},
            {"১৯৪২ সালের নভেম্বর মাসে", "১৯৪৫ সালের মে মাসে ", "১৯৪৩ সালের ফেব্রুয়ারী মাসে"},
            {"কাশাভুবু", "প্যাট্টিস লুমুম্বা", "মবুতু"},
            {"১৯৪৫ সালের আগষ্ট মাসে ", "১৯৪৫ সালের মে মাসে ", "এরা পানিতে থাকে১৯৪৪ সালের সেপ্টেম্বর মাসে "},
            {"ইউনিটা", "সান্ডিনিটা ", "কন্ট্রা"},
            {"ওয়াশিংটন", "মস্কো", "লন্ডন"},
            {"ইরান","ইরাক","মিশর"},
            {"ইটালী","স্পেন","তুরস্ক"},
            {"৪৭","৯১","১৪৩"},
            {"১৪০","১৪৪","১২০"},
            {"২৩","২৫","২৪.৫"},
            {"৫০%","৩০%","৩৩%"},
            {"72","48","60"},
            {"২","৪","৩"},
            {"৭০","৮০","৯০"},
            {"১২","১০","১১"},
            {"১৩.৫০ টাকা ","১৫ টাকা","২৫ টাকা "},
            {"২২%","২০%","২৫%"},
            {"সমকোনী","সমবাহু","স্থুলকোণী"},
            {"পারমানবিক জ্বালানী","পীট কয়লা","ফুয়েল সেল "},
            {"রান্নার জন্য শুধু তাপ নয় চাপ ও কাজে লাগে","বন্ধ পাত্রে তাপ সংরক্ষিত হয় ","উচ্চচাপে তরলের স্ফুনংক বৃদ্ধি পায়"},
            {"লাল-নীল-সবুজ","লাল-হলুদ-নীল","হলুদ-সবুজ-নীল"},
            {"র্মূল মধ্যারেখা","কর্কটক্রান্তি রেখা ","মকরক্রান্তি রেখা "},
            {"পানির মধ্যে দ্রবিভূত বাতাস হতে","পানিতে অক্সজেন ও হাইড্রোজেন বিশিষ্ট করে ","মাঝে মাঝে পানির উপর নাক তুলে"},
            {"ভিটামিন-সি ","লৌহা","ভিটামিন এ"},
            {"তামার দন্ড ও দস্তার দন্ড ","তামার দন্ড ও দস্তার কৌটা ","কার্বন দন্ড ও দস্তার কৌটা "},
            {"এতে বিদ্যুতের অপচয় কম হয় ","অধিক বিদ্যুৎ প্রবাহ পাওয়া যায় ","এতে কমে গিয়েও প্রয়োজনীয় ভোল্টেজ বজায় থাকে "},
            {"তামা ও টিন ","তামা ও দস্তা ","তামা ও নিকেল"},
            {"পেট্রোলিয়াম","কয়লা","বায়োগ্যাস"},
            {"","",""},

    };



    private String mCorrectAnswers[] = {"হোয়াইট হল ", "১৯৪৫ সালের মে মাসে ", "প্যাট্টিস লুমুম্বা", "১৯৪৫ সালের আগষ্ট মাসে ","কন্ট্রা","ওয়াশিংটন",
            "ইরাক","তুরস্ক","৪৭","১৪৪","২৫","৫০%","72","৪","৮০",
            "১০","২৫ টাকা ","২০%","সমকোনী","ফুয়েল সেল ","উচ্চচাপে তরলের স্ফুনংক বৃদ্ধি পায়","লাল-নীল-সবুজ","কর্কটক্রান্তি রেখা ",
            "গিরিশ চন্দ্র সেন","পানির মধ্যে দ্রবিভূত বাতাস হতে","লৌহা","কার্বন দন্ড ও দস্তার কৌটা ",
            "এতে বিদ্যুতের অপচয় কম হয় ",
            "তামা ও দস্তা ","বায়োগ্যাস","",""};




    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }


    public String getChoice1(int a) {
        String choice0 = mChoices[a][0];
        return choice0;
    }


    public String getChoice2(int a) {
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a) {
        String choice2 = mChoices[a][2];
        return choice2;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }
}
